In [1]:
import pandas as pd

In [3]:
#Load the Toyota sales dataset
toyota_data = pd.read_csv('toyota_sales_data.csv')

In [5]:
toyota_data.head()

,sale_id,sale_rep_id,sale_date,car_model,sale_amount,commission_pct,sale_status
0,1,16,2024-11-18,Tundra,44496.88,0.05,Completed
1,2,11,2024-11-08,Tacoma,34824.72,NaN,Pending
2,3,5,2024-11-03,Corolla,20275.08,NaN,Completed
3,4,20,2024-11-06,Corolla,20068.93,NaN,Completed
4,5,1,2024-11-26,Tundra,49811.99,0.03,Completed

In [6]:
toyota_data.isnull()

,sale_id,sale_rep_id,sale_date,car_model,sale_amount,commission_pct,sale_status
0,False,False,False,False,False,False,False
1,False,False,False,False,False,True,False
2,False,False,False,False,False,True,False
3,False,False,False,False,False,True,False
4,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...
4995,False,False,False,False,False,False,False
4996,False,False,False,False,False,False,False
4997,False,False,False,False,False,False,False
4998,False,False,False,False,False,True,False
4999,False,False,False,False,False,True,False

In [7]:
toyota_data.isnull().sum()

sale_id              0
sale_rep_id          0
sale_date            0
car_model            0
sale_amount          0
commission_pct    1274
sale_status          0
dtype: int64

In [8]:
toyota_data["commission_pct"] = toyota_data["commission_pct"].fillna(0)

In [10]:
toyota_data.head()

,sale_id,sale_rep_id,sale_date,car_model,sale_amount,commission_pct,sale_status
0,1,16,2024-11-18,Tundra,44496.88,0.05,Completed
1,2,11,2024-11-08,Tacoma,34824.72,0.00,Pending
2,3,5,2024-11-03,Corolla,20275.08,0.00,Completed
3,4,20,2024-11-06,Corolla,20068.93,0.00,Completed
4,5,1,2024-11-26,Tundra,49811.99,0.03,Completed

In [11]:
toyota_data.isnull().sum()

sale_id           0
sale_rep_id       0
sale_date         0
car_model         0
sale_amount       0
commission_pct    0
sale_status       0
dtype: int64

In [12]:
toyota_data = toyota_data.dropna(subset =["commission_pct"])

In [14]:
toyota_data.shape

(5000, 7)

In [15]:
toyota_data = pd.read_csv('toyota_sales_data.csv')

In [16]:
toyota_data = toyota_data.dropna(subset =["commission_pct"])

In [17]:
toyota_data.shape

(3726, 7)

In [18]:
toyota_data = pd.read_csv('toyota_sales_data.csv')

In [19]:
median_commission = toyota_data["commission_pct"].median()

In [20]:
median_commission

np.float64(0.03)

In [21]:
toyota_data["commission_pct"] = toyota_data["commission_pct"].fillna(median_commission).fillna(median_commission)

In [22]:
toyota_data

,sale_id,sale_rep_id,sale_date,car_model,sale_amount,commission_pct,sale_status
0,1,16,2024-11-18,Tundra,44496.88,0.05,Completed
1,2,11,2024-11-08,Tacoma,34824.72,0.03,Pending
2,3,5,2024-11-03,Corolla,20275.08,0.03,Completed
3,4,20,2024-11-06,Corolla,20068.93,0.03,Completed
4,5,1,2024-11-26,Tundra,49811.99,0.03,Completed
...,...,...,...,...,...,...,...
4995,4996,1,2024-11-06,Corolla,21484.83,0.05,Completed
4996,4997,8,2024-11-11,Camry,26519.24,0.05,Pending
4997,4998,18,2024-11-06,Tacoma,30780.39,0.02,Completed
4998,4999,10,2024-11-21,Corolla,22654.59,0.03,Completed
4999,5000,13,2024-11-21,Tundra,44525.85,0.03,Cancelled